## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.hub_networking.azurerm_network_security_group.nsgs["DevSubnet"] will be created
  + resource "azurerm_network_security_group" "nsgs" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "DevSubnet-nsg"
      + resource_group_name = "aztf-hub-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Git"         = "Github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "Hub"
          + "Source"      = "Terraform"
        }
    }

  # module.hub_networking.azurerm_network_security_group.nsgs["InfraSubnet"] will be created
  + resource "azurerm_network_security_group" "nsgs" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "InfraSubnet-nsg"
      + resource_group_name = "aztf-hub-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Git"         = "Github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "Hub"
          + "Source"      = "Terraform"
        }
    }

  # module.hub_networking.azurerm_resource_group.hub_rg will be created
  + resource "azurerm_resource_group" "hub_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "aztf-hub-rg"
      + tags     = {
          + "Environment" = "Dev"
          + "Git"         = "Github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "Hub"
          + "Source"      = "Terraform"
        }
    }

  # module.hub_networking.azurerm_subnet.hub_subnets["AzureBastionSubnet"] will be created
  + resource "azurerm_subnet" "hub_subnets" {
      + address_prefixes                              = [
          + "10.0.3.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureBastionSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-hub-rg"
      + virtual_network_name                          = "aztf-hub-vnet"
    }

  # module.hub_networking.azurerm_subnet.hub_subnets["AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet" "hub_subnets" {
      + address_prefixes                              = [
          + "10.0.1.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-hub-rg"
      + virtual_network_name                          = "aztf-hub-vnet"
    }

  # module.hub_networking.azurerm_subnet.hub_subnets["DevSubnet"] will be created
  + resource "azurerm_subnet" "hub_subnets" {
      + address_prefixes                              = [
          + "10.0.5.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "DevSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-hub-rg"
      + virtual_network_name                          = "aztf-hub-vnet"
    }

  # module.hub_networking.azurerm_subnet.hub_subnets["GatewaySubnet"] will be created
  + resource "azurerm_subnet" "hub_subnets" {
      + address_prefixes                              = [
          + "10.0.2.0/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-hub-rg"
      + virtual_network_name                          = "aztf-hub-vnet"
    }

  # module.hub_networking.azurerm_subnet.hub_subnets["InfraSubnet"] will be created
  + resource "azurerm_subnet" "hub_subnets" {
      + address_prefixes                              = [
          + "10.0.4.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "InfraSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-hub-rg"
      + virtual_network_name                          = "aztf-hub-vnet"
    }

  # module.hub_networking.azurerm_subnet_network_security_group_association.nsg_associations["DevSubnet"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_associations" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub_networking.azurerm_subnet_network_security_group_association.nsg_associations["InfraSubnet"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_associations" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub_networking.azurerm_virtual_network.hub_vnet will be created
  + resource "azurerm_virtual_network" "hub_vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "aztf-hub-vnet"
      + resource_group_name = "aztf-hub-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Git"         = "Github"
          + "Owner"       = "kmiszel"
          + "Purpose"     = "Hub"
          + "Source"      = "Terraform"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```
</details>